index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Emacs 入门基础</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-20 16:50:06 CST"/>
<meta name="author" content="erikge"/>
<meta name="description" content=""/>
<meta name="keywords" content="emacs, basic, startup"/>
</head>
<body>
<div id="content">

<h1 class="title">Emacs 入门基础</h1>

<p>学习emacs是一个挑战，但是却能体会更多软件世界的精彩。
最好的学习方法，随时用，尽量用。
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Emacs是什么 </a></li>
<li><a href="#sec-2">2 基本概念 </a>
<ul>
<li><a href="#sec-2.1">2.1 buffer </a></li>
<li><a href="#sec-2.2">2.2 window </a></li>
<li><a href="#sec-2.3">2.3 frame </a></li>
<li><a href="#sec-2.4">2.4 Emacs Lisp </a></li>
<li><a href="#sec-2.5">2.5 mode </a></li>
<li><a href="#sec-2.6">2.6 命令 </a></li>
<li><a href="#sec-2.7">2.7 快捷键 </a></li>
<li><a href="#sec-2.8">2.8 keymap </a></li>
</ul>
</li>
<li><a href="#sec-3">3 帮助系统 </a></li>
<li><a href="#sec-4">4 配置方法 </a>
<ul>
<li><a href="#sec-4.1">4.1 执行Elisp代码 </a></li>
<li><a href="#sec-4.2">4.2 安装插件 </a></li>
<li><a href="#sec-4.3">4.3 快捷键 </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Emacs是什么 </h2>
<div class="outline-text-2" id="text-1">

<p>正统的说法也许是"Emacs即Editor MACroS（宏编辑器），是一种文本编辑器"。
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 基本概念 </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> buffer </h3>
<div class="outline-text-3" id="text-2.1">

<p>缓冲区. Emacs并不直接对文件进行操作, 它是把文件加载进buffer, 用户直接操作buffer, 只有当用户确定把buffer中所做的修改写人文件时, Emacs才把buffer中的内容写入文件. buffer实际上就是一个内存缓冲区, 这和一般编辑器中都一样, 应该很好理解.
缓冲区之下是状态栏，显示当前的一些状态信息，比如图中从左至右依次为:
U: 当前的文件编码是UTF-8, 如果是GBK会显示c
**: 文件状态，**表示未保存，&ndash;表示可写，%%表示只读
</p></div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2"><span class="section-number-3">2.2</span> window </h3>
<div class="outline-text-3" id="text-2.2">

<p>窗口. 由于Emacs很早就诞生了, 它的窗口概念和现在基于窗口的操作系统中的窗口概念不是一样的. Emacs中的窗口是用来显示buffer的一个区域. 它并不像操作系统中的窗口拥有自己的标题栏,系统菜单栏.
</p></div>

</div>

<div id="outline-container-2.3" class="outline-3">
<h3 id="sec-2.3"><span class="section-number-3">2.3</span> frame </h3>
<div class="outline-text-3" id="text-2.3">

<p>Emacs中的frame就是操作系统中的窗口.
buffer是文件的内存表示, windows则是显示buffer的区域, 一个frame中可以有多个window, Emacs则可以有多个frame.
</p></div>

</div>

<div id="outline-container-2.4" class="outline-3">
<h3 id="sec-2.4"><span class="section-number-3">2.4</span> Emacs Lisp </h3>
<div class="outline-text-3" id="text-2.4">

<p>Emacs最基础的部分是用c写的，其他部分都是用Emacs Lisp语言写的，Emacs Lisp语言是基于lisp语言的. lisp是LISt Processor的缩写, 即链表处理语言, 所以lisp语言的操作都是基于链表的, 它的语法也是链表结构, 链表第一个元素表示函数名, 其他元素是参数, 比如通常语言中的a+b, 在lisp就是(+ a b)
</p></div>

</div>

<div id="outline-container-2.5" class="outline-3">
<h3 id="sec-2.5"><span class="section-number-3">2.5</span> mode </h3>
<div class="outline-text-3" id="text-2.5">

<p>mode有major mode和minor mode之分, 每个缓冲区对应一个major mode, 也只有一个major mode, 但是可以有多个minor mode. Emacs对每一种文件都有一个mode.
</p></div>

</div>

<div id="outline-container-2.6" class="outline-3">
<h3 id="sec-2.6"><span class="section-number-3">2.6</span> 命令 </h3>
<div class="outline-text-3" id="text-2.6">

<p>你对Emacs所有的操作都是对Emacs的命令的调用。比如，你在text-mode里，当你按下任何字母键进行编辑的时候，实际上是调用的emacs的命令self-insert-command.
</p></div>

</div>

<div id="outline-container-2.7" class="outline-3">
<h3 id="sec-2.7"><span class="section-number-3">2.7</span> 快捷键 </h3>
<div class="outline-text-3" id="text-2.7">

<p>Emacs中Control键用C表示,Alt键用M表示, 即: C-c表示Control C, M-x表示Alt x.
除掉以Alt键开头的，比如Alt a，Emacs中的快捷键基本上都有一个前缀，Emacs中最多的快捷键前缀就是C-x，C-c，前缀表示，你不必要一起按下前缀和后缀，可以先按下前 缀，Emacs会等待你按下剩余的快捷键，这样Emacs中的快捷键按起来非常的方便。
</p></div>

</div>

<div id="outline-container-2.8" class="outline-3">
<h3 id="sec-2.8"><span class="section-number-3">2.8</span> keymap </h3>
<div class="outline-text-3" id="text-2.8">

<p>键盘映射. Emacs的快捷键是通过keymap来控制的. 有全局和局部的keymap. 每个mode都会有一个自己的局部的keymap, 局部的keymap会覆盖全局的keymap, 另外如果对应的major mode有开启的minor mode, 而且这个minor mode有keymap的话, 这个minor mode的keymap会覆盖major mode的keymap.
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 帮助系统 </h2>
<div class="outline-text-2" id="text-3">

<p>Emacs的文档非常丰富, 有Elisp自己的自文档, 还有更详细的info. Elisp中的变量, 函数都有文档. 对于大多数情况都够用了.
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">快捷键</th><th scope="col">命令</th><th scope="col">说明</th></tr>
</thead>
<tbody>
<tr><td>C-h ?</td><td></td><td>关于帮助系统的帮助，可以通过SPC和DEL键滚动，通过ESC退出</td></tr>
<tr><td>C-h t</td><td>M-x help-with-tutorial</td><td>进入 《Emacs 快速指南》</td></tr>
<tr><td>C-h r</td><td>M-x info-emacs-manual</td><td>Emacs使用手册</td></tr>
<tr><td>C-h i</td><td>M-x info</td><td>《Emacs说明》</td></tr>
<tr><td>C-h a</td><td>M-x apropos-command</td><td>搜索命令</td></tr>
<tr><td>C-h v</td><td>M-x describe-variable</td><td>查看变量说明</td></tr>
<tr><td>C-h f</td><td>M-x describe-function</td><td>查看函数说明</td></tr>
<tr><td>C-h m</td><td>M-x describe-mode</td><td>查看当前mode的相关文档，包含mode中的命令、快捷键等</td></tr>
<tr><td>C-h k KEYS</td><td>M-x describe-key KEYS</td><td>查看快捷键对应的命令及其简要说明，比如C-h k C-x C-c，会告诉你C-x C-c是做什么的</td></tr>
<tr><td>C-h c KEYS</td><td>M-x describe-key-briefly</td><td>查看键绑定说明</td></tr>
<tr><td>C-h w</td><td>M-x where-is</td><td>查看某个命令对应的快捷键</td></tr>
<tr><td>C-h b</td><td>M-x describe-bindings</td><td>查看当前buffer所有的快捷键列表</td></tr>
<tr><td>KEYS C-h</td><td></td><td>查看当前buffer中以某个快捷键序列开头的快捷键列表，比如C-c C-h</td></tr>
<tr><td></td><td>M-x apropos</td><td>查看匹配某个关键词的任何东西，如函数，变量，命令，模式等</td></tr>
<tr><td></td><td>M-x find-function</td><td>查看函数的代码</td></tr>
<tr><td></td><td>M-x find-variable</td><td>查看变量的代码</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 配置方法 </h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4.1" class="outline-3">
<h3 id="sec-4.1"><span class="section-number-3">4.1</span> 执行Elisp代码 </h3>
<div class="outline-text-3" id="text-4.1">

<ol>
<li>
在某条语句后面按C-x C-e (eval-last-sexp)可以执行那条语句
</li>
<li>
M-x eval-buffer 可以执行当前buffer内的Elisp代码
</li>
<li>
选中一个region后, M-x eval-region可以执行这个region内的代码
</li>
</ol>
</div>

</div>

<div id="outline-container-4.2" class="outline-3">
<h3 id="sec-4.2"><span class="section-number-3">4.2</span> 安装插件 </h3>
<div class="outline-text-3" id="text-4.2">

<p>Emacs的插件一般都是一个以el为后缀名的文件, 把这个文件下载下来后放到一个目录, 比如~/emacs/lisps, 然后执行下面这两条语句:
</p>


<pre class="example">(add-to-list 'load-path "~/emacs/lisps")
(require 'pluginname)
</pre>



</div>

</div>

<div id="outline-container-4.3" class="outline-3">
<h3 id="sec-4.3"><span class="section-number-3">4.3</span> 快捷键 </h3>
<div class="outline-text-3" id="text-4.3">

<p>定制全局绑定global-set-key, 绑定某个mode的快捷键用define-key. global-set-key的定义为:
</p>


<pre class="example">(global-set-key key command)
</pre>



<p>
比如想把C-j绑定到”到达指定行上”(goto-line), 这样就可以了:
</p><pre class="example">
(global-set-key (kbd "C-j") 'goto-line)
</pre>

<p>kbd是Emacs的宏, 把快捷键转换为Emacs的内部按键表示. 然后执行上面那条语句, 就会使你的配置生效. 然后你可以用C-h k检查一下你的定制是否成功了.
</p>
<p>
如果对于比较复杂的快捷键, 比如Control x F3, 改怎么写呢? 按C-h k(describe-key), 然后再按下Control x F3, Emacs会出现一个”C-x “, 这个就是你要写到kbd宏里面的内容.
</p>
<p>
如果你想对某个特定模式比如c++-mode进行快捷键定制, 用define-key即可, 对于上面的例子这样写:
</p><pre class="example">
(define-key c++-mode-map (kbd "C-j") 'goto-line)
</pre>

<p>define-key第一个参数map一般为mode后面直接加”-map”
</p></div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: erikge
<a href="mailto:erikge@qq.com">&lt;erikge@qq.com&gt;</a>
</p>
<p class="date"> Date: 2012-04-20 16:50:06 CST</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
